Repository: anwersafy/juma
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Admin message
ar: رساله الادمن

source: Application
ar: تطبيق

# noInternet
source: No Internet Connection
ar: لا يوجد اتصال بالانترنت

source: Jummah
ar: الجمعة

source: Prayer Timings
ar: مواقيت الصلاة

source: Fajr
ar: الفجر

source: Sunrise
ar: الشروق

source: Zuhr
ar: الظهر

source: Asr
ar: العصر

source: Maghreb
ar: المغرب

source: Isha
ar: العشاء

# remaining_time
source: time
ar: المتبقي

source: Home
ar: الرئيسية

source: Sunnah on Friday
ar: سنن الجمعة

source: coming early for Jummah prayer
ar: التبكير للجمعة

source: First Hour
ar: الساعة الاولى

source: Like donating a camel
ar: كمن قرب بدنه

source: Second Hour
ar: الساعة الثانية

source: Like donating a cow
ar: كمن قرب بقرة

source: Third Hour
ar: الساعة الثالثة

source: like donating a horned ram
ar: كمن قرب كبش اقرن

source: Fourth Hour
ar: الساعة الرابعة

source: Like donating a chicken
ar: كمن قرب دجاجة

source: Fifth Hour
ar: الساعة الخامسة

source: Like donating an egg
ar: كمن قرب بيضة

source: from
ar: من

source: to
ar: الى

source: The first part of the night
ar: الثلث الاول

source: The second part of the night
ar: الثلث الثاني

source: The third part of the night
ar: الثلث الثالث

source: The evening remembrances
ar: اذكار المساء

source: The supplications upon waking up from sleep
ar: اذكار الاستيقاظ من النوم

# The_supplications_before_ablution
source: The supplications before ablution (wudu)
ar: اذكار قبل الوضوء

# The_supplications_after_the_Adhan
source: The supplications after the Adhan (call to prayer)
ar: اذكار الاذان

source: The supplications before sleep
ar: اذكار النوم

# The_supplications_before_and_after_eating
source: The supplications after prayer
ar: اذكار بعد السلام من الصلاه

source: The supplications after prayer
ar: اذكار بعد السلام من الصلاه

source: The morning remembrances
ar: اذكار الصباح

source: The General Radio - Varied broadcasting featurin different reciters.
ar: الاذاعة العامة- اذاعة متنوعة لمختلف القراء

source: The Holy Quran
ar: القران الكريم

source: Night Prayer
ar: قيام الليل

# Radio_Holy_Quran
source: Listening to the Quran
ar: سماع القران الكريم

source: The remembrances of a Muslim
ar: اذكار المسلم

source: Settings
ar: الاعدادات

source: Language
ar: اللغة

# Notics
source: Notifications
ar: تفعيل الاشعارات

source: Terms and Conditions and Privacy Policy
ar: الشروط و الاحكام و سياسة الخصوصية

source: Contact us via email
ar: تواصل معنا عبر البريد الالكتروني التالي

source: Post the link of this application via social media
ar: انشر رابط هذا التطبيق عبر وسائل التواصل االجتماعي

source: Notices
ar: الاشعارات

source: Reminder to read Surat Al-Kahf on Friday
ar: قراءة سورة الكهف يوم الجمعة

source: Reminder to come early on Friday
ar: التبكير يوم الجمعة

source: Remembering to pray in the last hour of Friday
ar: الدعاء في اخر ساعة من يوم الجمعة

source: Reminders to pray for the Prophet
ar: الصلاة على النبي صل الله عليه وسلم

source: Reminding the Duha prayer
ar: التذكير بصلاة الضحى

source: A reminder to fast on Mondays and Thursdays
ar: صيام الاثنين و الخميس

source: Reminder to fast the white days
ar: صيام الايام البيض

source: Reminder to do the night prayers
ar: التذكير بقيام الليل

source: Remembering to pray between the call to prayer and the iqama
ar: التذكير بالدعاء بين الاذان و الاقامة

source: Reminder to read daily roses from the Holy Quran
ar: التذكير بقراءة الورد اليومي من القران الكريم

source: Remembering the morning and evening remembrances
ar: التذكير باذكار الصباح و المساء

source: Reminding the entry of prayer times
ar: التذكير بدخول اوقات الصلاة

source: For who is the reward for this application?
ar: لمن اجر و ثواب هذا التطبيق

# for_Who
source: I testify to God Almighty that this application stood for me, my wife, my offspring, my parents, my mother, their parents, my brothers and sisters, our guardians and their offspring, our scholars and their offspring, every Muslim who uses this application, his wife and his offspring, and all dead Muslims
ar: أشهدالله تعالى أن هذا التطبيق وقف عني وعن زوجتى وعن ذريتي وعن والدي ووالدتي ووالديهم وعن اخواني واخواتي وعن ولاة أمرنا وذرياتهم وعن علمائنا وذرياتهم وعن كل مسلم يستخدم هذا التطبيق وعن زوجته وذريته وعن كل موتى المسلمين
